# coding=utf-8
import urllib.request
import json
import time
from bs4 import BeautifulSoup

# 最低分数
score_threshold = 100

# 关键字权值
keyword_weights = {
    "大数据": 20,
    "hadoop": 20,
    "hdfs": 10,
    "kafka": 5,
    "kettle": 20,
    "elasticsearch": 20,
    "hbase": 10,
    "flume": 10,
    "spark": 20,
    "hive": 5,
    "etl": 10,
    "jvm": 5,
    "linux": 5,
    "shell": 5}

cookie="__g=-; __c=1521613889; __l=r=https%3A%2F%2Fsignup.zhipin.com%2F&l=%2Fwww.zhipin.com%2Fboss%2Fcomplete%2Fbase.html; t=pPjDVkDLMhcrbqws; wt=pPjDVkDLMhcrbqws; __a=22969697.1521613509.1521613509.1521613889.30.2.29.30"
# 主管
#jobid="63f57778143d22d51nx53dm8EVQ~"
# 西安研发
#jobid="601a3a60fb1ee9641nx-3N2_ElE~"
# 杭州研发
jobid="022b4dbd0930109d1nx53dm5Flc~"

# 学历
education_set = ["本科", "硕士"]

# top400学校
schools = ["北京大学", "清华大学", "武汉大学", "复旦大学", "浙江大学", "上海交通大学", "南京大学", "中国人民大学", "吉林大学", "华中科技大学", "四川大学", "中山大学", "南开大学",
           "天津大学", "中国科学技术大学", "西安交通大学", "中南大学", "哈尔滨工业大学", "北京师范大学", "山东大学", "厦门大学", "东南大学", "北京航空航天大学", "同济大学",
           "东北大学", "大连理工大学", "华南理工大学", "华东师范大学", "电子科技大学", "湖南大学", "重庆大学", "西北工业大学", "中国农业大学", "兰州大学", "北京理工大学",
           "华中师范大学", "西南大学", "东北师范大学", "南京农业大学", "北京交通大学", "西南交通大学", "长安大学", "武汉理工大学", "河海大学", "华中农业大学", "南京师范大学",
           "郑州大学", "南京理工大学", "西安电子科技大学", "中国海洋大学", "华东理工大学", "苏州大学", "南京航空航天大学", "西北大学", "中国矿业大学", "北京科技大学", "北京协和医学院",
           "上海大学", "南昌大学", "西北农林科技大学", "湖南师范大学", "云南大学", "哈尔滨工程大学", "华南师范大学", "东华大学", "上海财经大学", "陕西师范大学", "中国政法大学",
           "暨南大学", "北京邮电大学", "江南大学", "合肥工业大学", "北京化工大学", "中南财经政法大学", "福建师范大学", "中国地质大学（武汉）", "深圳大学", "福州大学", "山西大学",
           "西南财经大学", "广西大学", "首都师范大学", "华南农业大学", "北京工业大学", "北京林业大学", "河南大学", "昆明理工大学", "燕山大学", "浙江工业大学", "中央民族大学",
           "中国石油大学（华东）", "对外经济贸易大学", "浙江师范大学", "首都医科大学", "安徽大学", "上海理工大学", "南京工业大学", "天津师范大学", "杭州电子科技大学", "河北大学",
           "东北林业大学", "湘潭大学", "新疆大学", "宁波大学", "黑龙江大学", "扬州大学", "安徽师范大学", "山东师范大学", "中央财经大学", "江苏大学", "上海师范大学", "大连海事大学",
           "辽宁大学", "太原理工大学", "华北电力大学", "中国石油大学（北京）", "南方医科大学", "东北财经大学", "青岛大学", "长沙理工大学", "天津医科大学", "中国药科大学",
           "北京中医药大学", "福建农林大学", "浙江工商大学", "江西师范大学", "哈尔滨医科大学", "西北师范大学", "南京邮电大学", "南京医科大学", "西南政法大学", "中国地质大学（北京）",
           "湖北大学", "山东农业大学", "海南大学", "内蒙古大学", "武汉科技大学", "云南师范大学", "西安建筑科技大学", "贵州大学", "华侨大学", "石河子大学", "汕头大学", "江西财经大学",
           "东北农业大学", "中国医科大学", "四川农业大学", "广西师范大学", "河南农业大学", "上海中医药大学", "广东外语外贸大学", "湖南农业大学", "杭州师范大学", "中国矿业大学（北京）",
           "广州大学", "浙江理工大学", "河北工业大学", "河南师范大学", "山东科技大学", "南京林业大学", "广东工业大学", "河北师范大学", "西安理工大学", "南京信息工程大学",
           "首都经济贸易大学", "成都理工大学", "北京语言大学", "华东政法大学", "天津工业大学", "中北大学", "重庆医科大学", "长春理工大学", "河北农业大学", "济南大学", "青岛科技大学",
           "中南民族大学", "宁夏大学", "东北电力大学", "江苏师范大学", "重庆邮电大学", "河南科技大学", "沈阳农业大学", "哈尔滨理工大学", "河南工业大学", "温州医科大学", "延边大学",
           "云南民族大学", "中国计量大学", "兰州交通大学", "四川师范大学", "南京中医药大学", "西南石油大学", "广州中医药大学", "云南农业大学", "重庆交通大学", "大连大学",
           "哈尔滨师范大学", "湖南科技大学", "长江大学", "辽宁师范大学", "河南理工大学", "西南民族大学", "山东理工大学", "曲阜师范大学", "西安科技大学", "温州大学", "兰州理工大学",
           "天津中医药大学", "南通大学", "内蒙古农业大学", "三峡大学", "北京工商大学", "天津科技大学", "东北石油大学", "安徽农业大学", "上海海事大学", "辽宁工程技术大学", "天津理工大学",
           "新疆农业大学", "中南林业科技大学", "沈阳工业大学", "安徽理工大学", "吉林农业大学", "安徽工业大学", "内蒙古师范大学", "上海海洋大学", "天津财经大学", "安徽财经大学",
           "安徽医科大学", "成都中医药大学", "西藏大学", "大连医科大学", "湖北工业大学", "桂林电子科技大学", "广西民族大学", "西南科技大学", "江西农业大学", "贵州师范大学",
           "山东财经大学", "沈阳药科大学", "西北民族大学", "江西理工大学", "重庆师范大学", "新疆医科大学", "浙江财经大学", "新疆师范大学", "陕西科技大学", "甘肃农业大学", "烟台大学",
           "黑龙江中医药大学", "华东交通大学", "河北医科大学", "集美大学", "青岛理工大学", "大连工业大学", "重庆工商大学", "石家庄铁道大学", "浙江农林大学", "山西师范大学",
           "南京财经大学", "河北科技大学", "南华大学", "南昌航空大学", "武汉纺织大学", "沈阳师范大学", "桂林理工大学", "景德镇陶瓷大学", "哈尔滨商业大学", "中国民航大学", "沈阳建筑大学",
           "长春工业大学", "东华理工大学", "北华大学", "浙江海洋大学", "武汉工程大学", "青海大学", "东莞理工学院", "广西医科大学", "江苏科技大学", "北京建筑大学", "华北理工大学",
           "上海对外经贸大学", "常州大学", "内蒙古工业大学", "内蒙古科技大学", "福建医科大学", "大连交通大学", "上海工程技术大学", "西北政法大学", "云南财经大学", "鲁东大学",
           "海南师范大学", "重庆理工大学", "吉林师范大学", "青海师范大学", "昆明医科大学", "西华大学", "聊城大学", "齐鲁工业大学", "广州医科大学", "吉首大学", "河南财经政法大学",
           "北京信息科技大学", "宁夏医科大学", "山西财经大学", "西安石油大学", "沈阳航空航天大学", "湖南中医药大学", "郑州轻工业学院", "西华师范大学", "广东财经大学", "北京联合大学",
           "华北水利水电大学", "浙江中医药大学", "太原科技大学", "山东建筑大学", "安徽建筑大学", "北方工业大学", "山西农业大学", "成都信息工程大学", "山东中医药大学", "渤海大学",
           "河北经贸大学", "北方民族大学", "青海民族大学", "山西医科大学", "西安工业大学", "福建中医药大学", "河南中医药大学", "吉林财经大学", "天津商业大学", "内蒙古民族大学",
           "西藏民族大学", "西安工程大学", "大连海洋大学", "信阳师范学院", "北京服装学院", "浙江科技学院", "安徽工程大学", "贵州民族大学", "青岛农业大学", "西安邮电大学",
           "江西中医药大学", "辽宁石油化工大学", "辽宁科技大学", "辽宁中医药大学", "湖南工业大学", "武汉轻工大学", "贵州医科大学", "中原工学院", "湖南商学院", "上海电力学院",
           "贵州财经大学", "黑龙江科技大学", "沈阳化工大学", "天津职业技术师范大学", "西南林业大学", "广东技术师范学院", "延安大学", "赣南师范大学", "淮北师范大学", "广西师范学院",
           "塔里木大学", "南京审计大学", "临沂大学", "中国青年政治学院", "齐齐哈尔大学", "长春中医药大学", "河北地质大学", "广东海洋大学", "南京工程学院", "大连民族大学", "吉林化工学院",
           "辽宁工业大学", "湖北中医药大学", "苏州科技大学", "黑龙江八一农垦大学", "新乡医学院", "沈阳理工大学", "上海应用技术大学", "安徽中医药大学", "山东工商学院", "新疆财经大学",
           "兰州财经大学", "福建工程学院", "河南科技学院", "丽水学院", "徐州医科大学", "合肥学院", "河北工程大学", "上海立信会计金融学院", "内蒙古医科大学", "重庆科技学院",
           "绍兴文理学院", "北京农学院", "嘉兴学院", "重庆文理学院", "北京印刷学院"]


headers = {
    "Accept": "text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8",
    "Accept-Language": "zh-CN,zh;q=0.9",
    "Connection": "keep-alive",
    "Cookie": cookie,
    "Host": "www.zhipin.com", "Referer": "https://www.zhipin.com/", "Upgrade-Insecure-Requests": "1",
    "User-Agent": "Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/64.0.3282.186 Safari/537.36"}


def openurl(url, data=None, charset='utf-8'):
    req = urllib.request.Request(url, data=data, headers=headers)
    r = urllib.request.urlopen(req)
    rs = r.read().decode(charset)
    return rs


def get_score(text):
    count = 0
    for keyword in keyword_weights.keys():
        count += text.count(keyword) * keyword_weights[keyword]
        count += text.lower().count(keyword) * keyword_weights[keyword]
    return count


def chat(data):
    data = urllib.parse.urlencode(data).encode('utf-8')
    rs = openurl("https://www.zhipin.com/chat/batchAddRelation.json", data=data)
    print(rs)


while True:
    for i in range(1, 30):
        url = "https://www.zhipin.com/boss/recommend/geeks.json?page=" + str(
                i) + "&status=0&jobid="+jobid+"&salary=0&experience=0&degree=0&_=1521855131825"
        rs = openurl(url)
        obj = json.loads(rs)
        html = BeautifulSoup(obj["htmlPreview"], 'html.parser')
        lis = html.select("li")
        print("page " + str(i))
        for li in lis:
            alink = li.select("a")[0]
            href = "https://www.zhipin.com/" + alink["href"]
            detail = openurl(href)
            score = get_score(detail)
            detailobj = BeautifulSoup(detail, 'html.parser')
            schoolNode = detailobj.select(".history-item .name b")[0]
            school = schoolNode.string
            education = schoolNode.parent.contents[4]
            if school in schools and education in education_set:
                if score >= score_threshold:
                    print("打招呼：" + str(score) + "分 " + education + " " + school + " " + href)
                    gid = alink["data-uid"]
                    jid = alink["data-jid"]
                    expectid = alink["data-expect"]
                    lidid = alink["data-lid"]
                    data = {
                        "gids": gid,
                        "jids": jid,
                        "expectIds": expectid,
                        "lids": lidid
                    }
                    chat(data)
                else:
                    print("不合适：" + href)

        time.sleep(5)
